In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv(r"D:\Python life\London Housing Data Analysis\file.csv")

In [4]:
data

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN
4,5/1/1995,city of london,84409,E09000001,10.0,NaN
...,...,...,...,...,...,...
13544,9/1/2019,england,249942,E92000001,64605.0,NaN
13545,10/1/2019,england,249376,E92000001,68677.0,NaN
13546,11/1/2019,england,248515,E92000001,67814.0,NaN
13547,12/1/2019,england,250410,E92000001,NaN,NaN
13548,1/1/2020,england,247355,E92000001,NaN,NaN

### Q. 1) Convert the Datatype of 'Date' column to Date-Time format.

In [5]:
data.date = pd.to_datetime(data["date"])

In [6]:
data.dtypes

date             datetime64[ns]
area                     object
average_price             int64
code                     object
houses_sold             float64
no_of_crimes            float64
dtype: object

### Q. 2) Add a new column ''year'' in the dataframe, which contains years only.

In [7]:
data.head(1)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN

In [8]:
data["year"] = data["date"].dt.year

In [9]:
data.head(1)

,date,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,city of london,91449,E09000001,17.0,NaN,1995

### (2.B) Add a new column ''month'' as 2nd column in the dataframe, which contains month only.

In [10]:
data.insert(1,"month" ,data["date"].dt.month)

In [11]:
data.head(1)

,date,month,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,1,city of london,91449,E09000001,17.0,NaN,1995

### Q. 3) Remove the columns 'year' and 'month' from the dataframe.

In [12]:
data.head(1)

,date,month,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,1,city of london,91449,E09000001,17.0,NaN,1995

In [13]:
data = data.drop("month", axis=1)

In [14]:
del data["year"]

In [15]:
data.head(1)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN

### Q. 4) Show all the records where 'No. of Crimes' is 0. And, how many such records are there ?

In [16]:
data.head(1)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN

In [17]:
data["no_of_crimes"].isnull()

0        True
1        True
2        True
3        True
4        True
         ...
13544    True
13545    True
13546    True
13547    True
13548    True
Name: no_of_crimes, Length: 13549, dtype: bool

### Q. 5) What is the maximum & minimum 'average_price' per year in england ?

In [18]:
data.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN
1,1995-02-01,city of london,82203,E09000001,7.0,NaN
2,1995-03-01,city of london,79121,E09000001,14.0,NaN
3,1995-04-01,city of london,77101,E09000001,7.0,NaN
4,1995-05-01,city of london,84409,E09000001,10.0,NaN

In [20]:
data["year"] = data["date"].dt.year

In [30]:
group_data = data[data["area"] == "england"].groupby("year")["average_price"].mean()

In [31]:
group_data.min()

53322.416666666664

In [32]:
group_data.max()

247355.0

### Q. 6) What is the Maximum & Minimum No. of Crimes recorded per area ?

In [35]:
data.groupby("area")["no_of_crimes"].min()

area
barking and dagenham      1217.0
barnet                    1703.0
bexley                     860.0
brent                     1850.0
bromley                   1441.0
camden                    2079.0
city of london               0.0
croydon                   2031.0
ealing                    1871.0
east midlands                NaN
east of england              NaN
enfield                   1635.0
england                      NaN
greenwich                 1513.0
hackney                   1870.0
hammersmith and fulham    1323.0
haringey                  1536.0
harrow                     937.0
havering                  1130.0
hillingdon                1445.0
hounslow                  1529.0
inner london                 NaN
islington                 1871.0
kensington and chelsea    1347.0
kingston upon thames       692.0
lambeth                   2381.0
lewisham                  1675.0
london                       NaN
merton                     819.0
newham                    2130.0
north east                   NaN
north west                   NaN
outer london                 NaN
redbridge                 1487.0
richmond upon thames       700.0
south east                   NaN
south west                   NaN
southwark                 2267.0
sutton                     787.0
tower hamlets             1646.0
waltham forest            1575.0
wandsworth                1582.0
west midlands                NaN
westminster               3504.0
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

In [34]:
data.groupby("area")["no_of_crimes"].max()

area
barking and dagenham      2049.0
barnet                    2893.0
bexley                    1914.0
brent                     2937.0
bromley                   2637.0
camden                    4558.0
city of london              10.0
croydon                   3263.0
ealing                    3401.0
east midlands                NaN
east of england              NaN
enfield                   2798.0
england                      NaN
greenwich                 2853.0
hackney                   3466.0
hammersmith and fulham    2645.0
haringey                  3199.0
harrow                    1763.0
havering                  1956.0
hillingdon                2819.0
hounslow                  2817.0
inner london                 NaN
islington                 3384.0
kensington and chelsea    2778.0
kingston upon thames      1379.0
lambeth                   4701.0
lewisham                  2813.0
london                       NaN
merton                    1623.0
newham                    3668.0
north east                   NaN
north west                   NaN
outer london                 NaN
redbridge                 2560.0
richmond upon thames      1551.0
south east                   NaN
south west                   NaN
southwark                 3821.0
sutton                    1425.0
tower hamlets             3316.0
waltham forest            2941.0
wandsworth                3051.0
west midlands                NaN
westminster               7461.0
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

### Q. 7) Show the total count of records of each area, where average price is less than 100000.

In [36]:
data.head(1)

,date,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,city of london,91449,E09000001,17.0,NaN,1995

In [37]:
data.dtypes

date             datetime64[ns]
area                     object
average_price             int64
code                     object
houses_sold             float64
no_of_crimes            float64
year                      int32
dtype: object

In [53]:
data[data["average_price"]<100000].groupby("area").size()

area
barking and dagenham     85
barnet                   25
bexley                   64
brent                    40
bromley                  33
city of london           11
croydon                  57
ealing                   31
east midlands            96
east of england          76
enfield                  54
england                  87
greenwich                59
hackney                  53
haringey                 33
harrow                   30
havering                 60
hillingdon               44
hounslow                 41
inner london             31
islington                19
kingston upon thames     30
lambeth                  41
lewisham                 62
london                   39
merton                   35
newham                   72
north east              112
north west              111
outer london             46
redbridge                52
south east               59
south west               78
southwark                48
sutton                   54
tower hamlets            47
waltham forest           64
wandsworth               26
west midlands            94
yorks and the humber    110
dtype: int64